package cn.sm.algorithms.base.list;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class DemoTest {
    public static void main(String[] args) {
        List<String> s = Arrays.asList("2_津CC3358", "1_京KL5999", "2_津CX1506", "2_京B24468", "2_辽PD6567", "2_京B27823", "2_京B26893", "93_京B18715D", "2_豫E91198", "2_京ADJ580", "2_京B20070", "2_京ACH670", "93_京B00130D", "2_鲁CM0913", "2_豫J89731", "2_京B21596", "2_京ACV067", "93_京B09699F", "1_京BW5093", "2_京AJE666", "2_冀DR6803", "2_辽LA6336", "2_京B15148", "2_京B26872", "2_京AMT662", "2_鲁RA0299", "2_京AX0508", "2_京B13284", "2_京B11799", "2_京B14659", "93_京B18718D", "1_京BW0758", "93_京B13918D", "2_京B14400", "1_京PZW508", "2_辽GJ2143", "2_豫PE1586", "2_京B23969", "2_京B20133", "2_晋D53032", "2_京B26955", "2_冀HD6376", "2_京B14081", "2_辽PD7187", "2_晋J57506", "93_京B19015D", "2_京B27710", "93_京B18260D", "2_新M57480", "93_京B18522F", "2_京B27751", "2_京B12742", "2_冀GE6714", "2_京B25025", "2_京B13858", "2_京B10129", "2_京B15580", "2_京ACT698", "93_京B08836D", "2_京B15403", "93_京B01500D", "2_津AN6089", "2_京B15514", "2_豫PQ6566", "93_京B03075F", "2_京B15529", "2_冀RC9858", "2_京B29805", "2_京AEH534", "2_津C89391", "2_豫RAQ879", "2_京B26993", "2_京B20028", "2_吉BA1777", "2_冀RD7575", "2_京B14668", "2_冀HA6167", "93_冀R03628D", "2_甘AA9568", "2_京B10664", "2_黑EC6249", "2_豫JC2912", "1_京BV0660", "2_晋JN1236", "2_京B29506", "2_京B29793", "2_京B14889", "1_京JHN753", "2_新B70727", "1_冀H3P851", "2_黑EN0339", "1_京BW3228", "2_京B25010", "2_京AFP722", "2_京B22035", "2_京ALH278", "93_冀R08385D", "2_冀RC8171", "2_京AV2795", "1_京Q83VG5");
        List<String> d = Arrays.asList("2_京B11799", "2_京B13858", "2_辽GJ2143", "2_京B14668", "2_京B15514", "2_京B26893", "93_京B18260D", "2_京B29805", "2_京AV2795", "2_黑EC6249", "2_京B15529", "2_晋JN1236", "93_冀R08385D", "2_京B15403", "1_京JHN753", "2_津C89391", "2_冀GE6714", "2_津CC3358", "2_京B21596", "2_京B24468", "2_京B20028", "2_冀RC8171", "2_冀DR6803", "93_京B00130D", "1_冀H3P851", "2_甘AA9568", "93_京B18718D", "2_京AFP722", "2_吉BA1777", "2_豫PE1586", "2_黑EN0339", "2_京B10129", "2_晋J57506", "2_豫J89731", "2_京AEH534", "2_京B26955", "2_京B23969", "2_辽PD7187", "2_晋D53032", "93_冀R03628D", "2_京B27751", "2_冀RD7575", "2_京ACH670", "2_京ALH278", "93_京B08836D", "2_京B15148", "2_豫E91198", "93_京B01500D", "93_京B18522F", "1_京BW5093", "2_京B10664", "93_京B03075F", "2_京B20070", "2_京AJE666", "2_京AMT662", "2_京B27823", "2_辽LA6336", "2_京B29793", "2_鲁RA0299", "2_冀RC9858", "2_京AX0508", "93_京B19015D", "93_京B13918D", "2_京ACT698", "1_京BW3228", "2_新B70727", "2_冀HD6376", "1_京BW0758", "2_鲁CM0913", "93_京B09699F", "2_新M57480", "2_豫RAQ879", "2_京B12742", "2_津CX1506", "2_京B14889", "2_京B26872", "2_京B26993", "2_京B25025", "2_京B22035", "2_京B20133", "2_京ADJ580", "2_京B14081", "2_京B29506", "2_京B14400", "93_京B18715D", "2_京B14659", "2_豫JC2912", "1_京PZW508", "1_京BV0660", "1_京KL5999", "2_京B27710", "2_京B25010", "2_京B15580", "2_京ACV067", "2_京B13284", "2_冀HA6167", "2_豫PQ6566", "2_津AN6089", "2_辽PD6567");

        List<String> source = new ArrayList<String>();
        source.addAll(s);
        List<String> dest = new ArrayList<>();
        dest.addAll(d);
        source.removeAll(dest);
        System.out.println(source);

    }
}
